---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorGenderType
source: html/22b96ed9-f9cf-46bf-6b0e-a52eae9fbb24.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorGenderType Property

"Connector Gender Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorGenderType { get; }
```